[
  {
    "id": 1,
    "chatbot_reply": "Welcome! I'm here to help you explore the exciting world of career possibilities. To make this journey as helpful as possible, I'd love to get to know you a bit better.",
    "question_text": "First things first, what name should I call you by?",
    "options": [
      { 
        "id": 101, 
        "option_text": "Enter your name...", 
        "next_question_id": 2,
        "type": "input" 
      }
    ],
    "is_final": false
  },
  {
    "id": 2,
    "chatbot_reply": "It's great to meet you! Let's start with the big picture. Understanding your core motivation is the key to finding a career that doesn't just pay the bills, but truly fulfills you.",
    "question_text": "When you imagine your future work, what kind of problems do you get the most excited about solving?",
    "options": [
      { "id": 202, "option_text": "Human-Centered Problems: I'm passionate about understanding people's needs, improving their experiences, and creating things that help others.", "next_question_id": 3 },
      { "id": 201, "option_text": "Logical Puzzles & Systems: I love untangling complex systems, finding efficiencies, and building things that work flawlessly.", "next_question_id": 3 },
      { "id": 203, "option_text": "Strategic Challenges: I enjoy thinking about the big picture, identifying opportunities, and leading teams to achieve ambitious goals.", "next_question_id": 3 }
    ],
    "is_final": false
  },
  {
    "id": 3,
    "chatbot_reply": "That's a very insightful answer. It tells me a lot about your natural mindset. Now, let's think about *how* you prefer to work. Your ideal environment is just as important as the work itself.",
    "question_text": "Which of these work styles feels most like you?",
    "options": [
      { "id": 303, "option_text": "I thrive in a collaborative setting, bouncing ideas off a team.", "next_question_id": 4 },
      { "id": 301, "option_text": "I prefer a clear plan and structured tasks to execute perfectly.", "next_question_id": 4 },
      { "id": 304, "option_text": "I do my best work when I can focus deeply on my own, without interruptions.", "next_question_id": 4 },
      { "id": 302, "option_text": "I enjoy having the freedom to experiment and figure things out as I go.", "next_question_id": 4 }
    ],
    "is_final": false
  },
  {
    "id": 4,
    "chatbot_reply": "Excellent. We're building a great profile of your professional personality. Now, let's connect this to your academic interests.",
    "question_text": "Thinking about your studies, which of these broad fields sparks the most genuine curiosity in you?",
    "options": [
      { "id": 402, "option_text": "Commerce & Business (How systems of money and people operate)", "next_question_id": 200 },
      { "id": 403, "option_text": "Arts & Humanities (How we express ideas, culture, and creativity)", "next_question_id": 300 },
      { "id": 401, "option_text": "Science & Technology (How things work, from code to the cosmos)", "next_question_id": 10 }
    ],
    "is_final": false
  },
  {
    "id": 10,
    "chatbot_reply": "A perfect choice for a logical mind. The world of Science & Technology is driven by the kind of structured problem-solving you enjoy. Let's get more specific.",
    "question_text": "When you think about technology, what aspect is most fascinating?",
    "options": [
      { "id": 1001, "option_text": "The tangible world: Building physical machines, electronics, and robotics.", "next_question_id": 999 },
      { "id": 1002, "option_text": "The abstract world: Architecting software, analyzing data, and creating AI.", "next_question_id": 11 },
      { "id": 1003, "option_text": "The protective world: Defending systems, finding vulnerabilities, and cybersecurity.", "next_question_id": 999 }
    ],
    "is_final": false
  },
  {
    "id": 11,
    "chatbot_reply": "That's a key distinction. Focusing on the abstract world of software and data is where many of today's biggest innovations are happening. Let's keep going.",
    "question_text": "Imagine you're on a software team. What role would you naturally gravitate towards?",
    "options": [
        { "id": 1102, "option_text": "The Builder: Writing the code and bringing the design to life.", "next_question_id": 12 },
        { "id": 1103, "option_text": "The Analyst: Testing the system, finding bugs, and analyzing the data.", "next_question_id": 999 },
        { "id": 1101, "option_text": "The Architect: Designing the blueprint and overall structure of the project.", "next_question_id": 12 }
    ],
    "is_final": false
  },
  {
    "id": 12,
    "chatbot_reply": "Okay, an architect or a builder. That's the heart of engineering. Now, let's think about the *scale* of the projects that excite you.",
    "question_text": "Which of these project types sounds more appealing?",
    "options": [
      { "id": 1202, "option_text": "Creating a highly specialized, complex tool that solves one specific problem perfectly.", "next_question_id": 13 },
      { "id": 1201, "option_text": "Building a massive, scalable system that can serve millions of users, like a social media backend or a cloud service.", "next_question_id": 13 },
      { "id": 1203, "option_text": "Developing a data-intensive model that can analyze information and predict future trends.", "next_question_id": 13 }
    ],
    "is_final": false
  },
  {
    "id": 13,
    "chatbot_reply": "That gives me a great sense of your ambition. Knowing the scale you want to work at is crucial. Now, a bit about your personal style.",
    "question_text": "When you're learning a new technical skill, what's your preferred method?",
    "options": [
      { "id": 1303, "option_text": "I jump right in and start building, looking things up as I hit problems.", "next_question_id": 14 },
      { "id": 1302, "option_text": "I find a good tutorial or course and follow along with the examples.", "next_question_id": 14 },
      { "id": 1301, "option_text": "I read the official documentation to understand the theory first.", "next_question_id": 14 }
    ],
    "is_final": false
  },
  {
    "id": 14,
    "chatbot_reply": "Excellent. That tells me about your approach to problem-solving. Now, let's get to the fun part: the specific technologies.",
    "question_text": "When you think about a new app or website, what layer of the technology is most exciting to you?",
    "options": [
      { "id": 1403, "option_text": "The entire system working together (Full Stack).", "next_question_id": 15 },
      { "id": 1401, "option_text": "The backend logic and database architecture (how it works).", "next_question_id": 15 },
      { "id": 1402, "option_text": "The beautiful and intuitive user interface (how it looks and feels).", "next_question_id": 999 }
    ],
    "is_final": false
  },
  {
    "id": 15,
    "chatbot_reply": "Perfect. Focusing on the core engine of an application is a strong indicator for a career in backend or full-stack engineering. We're on the final question.",
    "question_text": "In the tech world, which of these cutting-edge domains would you be most excited to specialize in?",
    "options": [
        { "id": 1502, "option_text": "Web & Mobile App Development (Building apps for people to use)", "next_question_id": 100 },
        { "id": 1503, "option_text": "Cloud Computing & DevOps (Building scalable infrastructure)", "next_question_id": 100 },
        { "id": 1501, "option_text": "Artificial Intelligence & Machine Learning (Creating intelligent systems)", "next_question_id": 100 }
    ],
    "is_final": false
  },
  {
    "id": 100,
    "chatbot_reply": "Thank you for sharing your thoughts. Based on our detailed conversation, it's clear you have a strong aptitude for engineering. I've prepared a personalized roadmap for you. I wish you the very best on your exciting journey!",
    "question_text": "### Your Personalized Roadmap: Software Engineering & Development 🚀\n\n**This path is a strong fit because you show an alignment with:**\n* **Mindset:** A logical approach to solving complex, abstract problems at scale.\n* **Interest:** A clear fascination with architecting and building the core logic of digital solutions.\n* **Work Style:** A desire to be a hands-on builder or a strategic architect in a technical team.\n\n**To succeed in this field, focus on these key areas:**\n* **Foundational Languages:** Master at least one core language like Python, Java, or C++.\n* **Web Technologies:** Become proficient in JavaScript/TypeScript and a modern framework like React.\n* **Core Concepts:** Deeply understand Data Structures, Algorithms, and Database Management.",
    "options": null,
    "is_final": true
  },
  {
    "id": 200,
    "chatbot_reply": "Thank you for that insightful conversation. Based on your profile, I've created a recommended path for you. I wish you the best of luck on your journey into the world of business!",
    "question_text": "### Your Personalized Roadmap: Finance & Management 📈\n\n**This path is a strong fit because you show an alignment with:**\n* **Mindset:** A strategic and analytical approach to decision-making.\n* **Interest:** A clear fascination with the systems of finance and organizational leadership.\n* **Work Style:** A preference for data-driven strategies and a focus on long-term growth.\n\n**To succeed in this field, focus on these key areas:**\n* **Quantitative Skills:** Excel in subjects like Accountancy, Financial Management, and Economics.\n* **Professional Certifications:** Consider pursuing globally recognized qualifications like CA (Chartered Accountancy) or CFA (Chartered Financial Analyst).\n* **Higher Education:** An MBA in Finance from a top institution can be a powerful career accelerator.\n* **Practical Experience:** Seek internships in finance firms, private equity, or management consulting. Analyze the stock market to build practical knowledge.",
    "options": null,
    "is_final": true
  },
  {
    "id": 300,
    "chatbot_reply": "It was a pleasure getting to know your creative side. Based on your unique talents, I've prepared a personalized roadmap for you. I wish you the very best on your creative journey!",
    "question_text": "### Your Personalized Roadmap: UX/UI & Digital Media Design 🎨\n\n**This path is a strong fit because you show an alignment with:**\n* **Mindset:** A human-centered approach to problem-solving, focusing on clarity and beauty.\n* **Interest:** A passion for creating engaging and intuitive interactive experiences.\n* **Work Style:** A desire to use your creative talents to produce clear, informative, and beautiful work.\n\n**To succeed in this field, focus on these key areas:**\n* **Design Tools:** Master the industry-standard tools like Figma, Adobe XD, and the Adobe Creative Suite.\n* **Core Principles:** Deeply understand User Research, Wireframing, Prototyping, and Interaction Design.\n* **Build Your Portfolio:** This is the single most important asset. Create a professional website showcasing 3-5 high-quality personal or freelance projects.\n* **Communication Skills:** Learn to articulate your design decisions and collaborate effectively with developers and product managers.",
    "options": null,
    "is_final": true
  },
  {
    "id": 999,
    "chatbot_reply": "Thank you for your answers. Based on your selections, your profile points towards some exciting fields like robotics, cybersecurity, or user interface design.",
    "question_text": "While this specific guided quiz is tailored towards a software engineering path, your interests are incredibly valuable in the tech industry. We encourage you to explore these areas further!\n\n**Potential fields to research:**\n* Mechatronics & Robotics Engineering\n* Cybersecurity Analysis\n* UI/UX Design\n* Data Analytics",
    "options": null,
    "is_final": true
  }
]